frontend/controllers/CaripesertaController.php

    public function actionGetDataPeserta($nikkes)
    {
        $dataPeserta = Peserta::find()->where(['nikkes'=>$nikkes])->one();
---
SELECT `nikkes` FROM `peserta` WHERE nikkes LIKE "%578%" ORDER BY `nikkes`